app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def create
#     prints out parameters to the screen
#   can see hash & key
    # render text: params.inspect
    # do this to know which params to require below

    @driver = Driver.new(
    params.require(:driver).permit(:first_name, :last_name)
    )

    if @driver.save
---
INSERT INTO "drivers" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "b"], ["last_name", "t"], ["created_at", "2015-01-25 10:01:32.694310"], ["updated_at", "2015-01-25 10:01:32.694310"]]